{
  "orderPollingWindowMinutes": {
    "value": 180,
    "unit": "minutes",
    "description": "Controls how far back to request orders when no pagination cursor is available. Increase to capture more historical orders; decrease to limit queries to recent activity."
  },
  "pollIntervalMs": {
    "value": 5000,
    "unit": "milliseconds",
    "description": "Delay between successive polling requests for orders. Lower this value for faster updates at the cost of additional network load; raise it to reduce traffic."
  },
  "pollLimit": {
    "value": 50,
    "description": "Maximum number of orders requested per poll. Increase to fetch more orders at once; decrease to shrink payload sizes."
  },
  "driftBufferMs": {
    "value": 120000,
    "unit": "milliseconds",
    "description": "Amount of time subtracted from the latest cursor to account for clock drift. Increase to guard against missed orders; decrease to minimize duplicate retrievals."
  },
  "staleActiveRetentionMs": {
    "value": 7200000,
    "unit": "milliseconds",
    "description": "Retention window for active orders kept in memory before pruning. Increase to keep orders visible longer; decrease to reclaim memory sooner."
  },
  "staleReadyRetentionMs": {
    "value": 21600000,
    "unit": "milliseconds",
    "description": "Retention window for ready orders before they are pruned. Increase to keep fulfilled orders available longer; decrease to clear them out more quickly."
  },
  "targetedFetchConcurrency": {
    "value": 3,
    "description": "Number of targeted fetch requests that may run in parallel. Increase to fan out more aggressively; decrease to limit concurrent load."
  },
  "targetedFetchMaxRetries": {
    "value": 2,
    "description": "Maximum retry attempts for targeted fetches when they fail. Increase to make the system more persistent; decrease to fail faster."
  },
  "targetedFetchBackoffMs": {
    "value": 400,
    "unit": "milliseconds",
    "description": "Delay applied between targeted fetch retry attempts. Increase for a gentler retry cadence; decrease to retry more rapidly."
  },
  "ordersEndpoint": {
    "value": "https://doughmonster-worker.thedoughmonster.workers.dev/api/orders",
    "description": "Worker endpoint used for fetching orders. Point this to a different worker origin to change the orders source."
  },
  "menusEndpoint": {
    "value": "https://doughmonster-worker.thedoughmonster.workers.dev/api/menus",
    "description": "Worker endpoint used for fetching menu data. Update this if the menus API location changes."
  },
  "configSnapshotEndpoint": {
    "value": "https://doughmonster-worker.thedoughmonster.workers.dev/api/config/snapshot",
    "description": "Worker endpoint used for fetching configuration snapshots. Modify this when the configuration API location changes."
  }
}
